app/controllers/authors_controller.rb

SELECT * FROM "authors" WHERE (user_id = 1)
---
  def index
    @authors = Author.paginate :page => params[:page], :per_page => 10, :conditions => ["user_id = ?", current_user.id]

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def show
    @author = Author.find(params[:id])

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("name", "created_at", "updated_at", "user_id") VALUES('Jesus Carretero', '2009-02-23 23:20:39', '2009-02-23 23:20:39', NULL)
---
  def create
   @author = Author.new(params[:author])
   @author.user_id ||= current_user.id

    respond_to do |format|
      if @author.save

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
UPDATE "authors" SET "updated_at" = '2009-02-13 23:05:16', "name" = 'Ola Bini Nl' WHERE "id" = 1
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])