app/controllers/editors_controller.rb

SELECT * FROM "editors" WHERE (user_id = 1)
---
  def index
    @editors = Editor.paginate :page => params[:page], :per_page => 10, :conditions => ["user_id = ?", current_user.id]

SELECT * FROM "editors" WHERE ("editors"."id" = 1)
---
  def show
    @editor = Editor.find(params[:id])

SELECT * FROM "editors" WHERE ("editors"."id" = 1)
---
  def edit
    @editor = Editor.find(params[:id])

INSERT INTO "editors" ("name", "created_at", "updated_at", "user_id") VALUES('Saraiva', '2009-02-24 00:51:12', '2009-02-24 00:51:12', 1)
---
  def create
    @editor = Editor.new(params[:editor])
    @editor.user_id ||= current_user.id

    respond_to do |format|
      if @editor.save

SELECT * FROM "editors" WHERE ("editors"."id" = 2)
UPDATE "editors" SET "updated_at" = '2009-02-13 23:04:39', "name" = 'BrasPort' WHERE "id" = 2
---
  def update
    @editor = Editor.find(params[:id])

    respond_to do |format|
      if @editor.update_attributes(params[:editor])