app/controllers/notes_controller.rb

  def index
    @notes = @publication.notes.find(:all)
---
SELECT * FROM "notes" WHERE ("notes".publication_id = 1)

  def show
    @note = @publication.notes.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1 AND ("notes".publication_id = 1))

  def edit
    @note = @publication.notes.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1 AND ("notes".publication_id = 1))

  def create
    @note = @publication.notes.build(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("name", "created_at", "body", "updated_at", "last_page", "publication_id", "init_page") VALUES('teste 1', '2009-02-16 17:14:27', 'teste de notas de texto', '2009-02-16 17:14:27', 10, 1, 1)

  def update
    @note = @publication.notes.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1 AND ("notes".publication_id = 1))
UPDATE "notes" SET "updated_at" = '2009-04-13 20:43:06', "body" = 'Um crime particularmente "fotogênico".' WHERE "id" = 4

  def destroy
    @note = @publication.notes.find(params[:id])
    @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 2 AND ("notes".publication_id = 3))
DELETE FROM "notes" WHERE "id" = 2

  def load_publication
    @publication = Publication.find(params[:publication_id])
---
SELECT * FROM "publications" WHERE ("publications"."id" = 3)