app/controllers/publications_controller.rb

  def index
    @publications = Publication.paginate :page => params[:page], :per_page => 15, :conditions => ["user_id = ?", current_user.id]
---
SELECT * FROM "publications" WHERE (user_id = 1)

  def show
    @publication = Publication.find(params[:id])
---
SELECT * FROM "publications" WHERE ("publications"."id" = 1)

  def edit
    @publication = Publication.find(params[:id])
---
SELECT * FROM "publications" WHERE ("publications"."id" = 1)

  def create
    @publication = Publication.new(params[:publication])
    @publication.user_id ||= current_user.id

    respond_to do |format|
      if @publication.save
---
INSERT INTO "publications" ("idiom", "created_at", "editor_id", "title", "isbn", "license", "updated_at", "media", "source") VALUES('Portugues', '2009-02-14 00:23:53', 2, 'Repensando a web com Rails', '85-7452-286-4', 'Copyright', '2009-02-14 00:23:53', 'Livro', '')

  def update
    @publication = Publication.find(params[:id])

    respond_to do |format|
      if @publication.update_attributes(params[:publication])
---
SELECT * FROM "publications" WHERE ("publications"."id" = 1)
UPDATE "publications" SET "updated_at" = '2009-02-14 00:16:52', "idiom" = 'Portugues' WHERE "id" = 1

  def find_editores
    Editor.find(:all, :order => 'name', :conditions => ["user_id = ?", current_user.id]).map {|e| [e.name, e.id]}
---
SELECT "editors".id FROM "editors" WHERE ("editors"."name" = 'Apress' AND "editors".id <> 1) LIMIT 1

  def find_authors
    Author.find(:all, :order => 'name', :conditions => ["user_id = ?", current_user.id])
---
SELECT "authors".id FROM "authors" WHERE ("authors"."name" = 'Bernardo Toro' AND "authors".id <> 1) LIMIT 1