app/controllers/reviews_controller.rb

  def create
    #@review = Review.find(params[:review])
    @review = @publication.build_review(params[:review])

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("created_at", "body", "updated_at", "publication_id") VALUES('2009-02-16 15:45:37', 'test', '2009-02-16 15:45:37', 1)
UPDATE "reviews" SET "publication_id" = NULL, "updated_at" = '2009-02-16 15:51:53' WHERE "id" = 2

  def update
    #@review = Review.find(params[:id])
    @review = @publication.review

    respond_to do |format|
      if @review.update_attributes(params[:review])
---
UPDATE "reviews" SET "updated_at" = '2009-02-17 12:26:29', "body" = 'test test' WHERE "id" = 1

  def load_publication
    @publication = Publication.find(params[:publication_id])
---
SELECT * FROM "publications" WHERE ("publications"."id" = 1)