app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '6086a628fd1315263327b78d7a0966738e540da7', '2009-02-23 16:36:00', 'a590cd740dcbd79d1858a4739c6fc5f4be612db3', NULL, '2009-02-23 16:36:00', NULL, 'eleudson', 'eleudson@lab.inf.uc3m.es')